In [155]:
import pandas as pd
import numpy as np
df= pd.read_csv(r"C:\Users\Tetra\Downloads\6svfo1.csv")
df.head()

  patient_id          name   age gender     city admission_date height_cm
0       P001           NaN  25.0      F   mumbai     15/01/2024       180
1       P002  Rahul Sharma  60.0      F    Delhi     2024/01/16       170
2       P003    Neha Singh  45.0      M   Mumbai     2024/01/16       150
3       P004    Neha Singh  60.0   Male  kolkata     15/01/2024       170
4       P005    Neha Singh  25.0   Male  kolkata     2024-01-15       180

In [156]:
df.tail()

    patient_id          name   age  gender     city admission_date height_cm
125       P006   Anita Verma  25.0       M   Mumbai     2024-01-15       150
126       P007    Neha Singh  25.0       F  kolkata     15/01/2024       150
127       P008     John Paul  60.0       F  Chennai     2024-01-15       160
128       P009           NaN  45.0       M   Mumbai     2024-01-15       150
129       P010  Rahul Sharma  60.0  Female  Chennai     2024/01/16       150

In [157]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 130 entries, 0 to 129
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   patient_id      130 non-null    object
 1   name            107 non-null    object
 2   age             106 non-null    float64
 3   gender          130 non-null    object
 4   city            130 non-null    object
 5   admission_date  130 non-null    object
 6   height_cm       130 non-null    object
dtypes: float64(1), object(6)
memory usage: 7.2+ KB

In [158]:
df.describe

<bound method NDFrame.describe of     patient_id          name   age  gender     city admission_date height_cm
0         P001           NaN  25.0       F   mumbai     15/01/2024       180
1         P002  Rahul Sharma  60.0       F    Delhi     2024/01/16       170
2         P003    Neha Singh  45.0       M   Mumbai     2024/01/16       150
3         P004    Neha Singh  60.0    Male  kolkata     15/01/2024       170
4         P005    Neha Singh  25.0    Male  kolkata     2024-01-15       180
..         ...           ...   ...     ...      ...            ...       ...
125       P006   Anita Verma  25.0       M   Mumbai     2024-01-15       150
126       P007    Neha Singh  25.0       F  kolkata     15/01/2024       150
127       P008     John Paul  60.0       F  Chennai     2024-01-15       160
128       P009           NaN  45.0       M   Mumbai     2024-01-15       150
129       P010  Rahul Sharma  60.0  Female  Chennai     2024/01/16       150

[130 rows x 7 columns]>

In [159]:
df.isnull().sum()

patient_id         0
name              23
age               24
gender             0
city               0
admission_date     0
height_cm          0
dtype: int64

In [160]:
df["gender"].replace('Male','M',inplace=True)

C:\Users\Tetra\AppData\Local\Temp\ipykernel_23024\633190661.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["gender"].replace('Male','M',inplace=True)

In [161]:
df["gender"].replace('Female','F',inplace=True)

C:\Users\Tetra\AppData\Local\Temp\ipykernel_23024\3949199343.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["gender"].replace('Female','F',inplace=True)

In [162]:
df["gender"]

0      F
1      F
2      M
3      M
4      M
      ..
125    M
126    F
127    F
128    M
129    F
Name: gender, Length: 130, dtype: object

In [163]:
df

    patient_id          name   age gender     city admission_date height_cm
0         P001           NaN  25.0      F   mumbai     15/01/2024       180
1         P002  Rahul Sharma  60.0      F    Delhi     2024/01/16       170
2         P003    Neha Singh  45.0      M   Mumbai     2024/01/16       150
3         P004    Neha Singh  60.0      M  kolkata     15/01/2024       170
4         P005    Neha Singh  25.0      M  kolkata     2024-01-15       180
..         ...           ...   ...    ...      ...            ...       ...
125       P006   Anita Verma  25.0      M   Mumbai     2024-01-15       150
126       P007    Neha Singh  25.0      F  kolkata     15/01/2024       150
127       P008     John Paul  60.0      F  Chennai     2024-01-15       160
128       P009           NaN  45.0      M   Mumbai     2024-01-15       150
129       P010  Rahul Sharma  60.0      F  Chennai     2024/01/16       150

[130 rows x 7 columns]

In [164]:
df["city"].value_counts()

city
kolkata    30
mumbai     26
Mumbai     25
Chennai    25
Delhi      24
Name: count, dtype: int64

In [165]:
df["height_cm"].max()
#i wasnt able to find out the maximum height sue to the object data-type of this column

'abc'

In [166]:
# we neeed to to change the data type of height column in order to make the data more acessible and easy to analyse
df["height_cm"]= pd.to_numeric(df["height_cm"],errors="coerce")
# here we use coerce to convert invalid values into nan

In [167]:
df["height_cm"]

0      180.0
1      170.0
2      150.0
3      170.0
4      180.0
       ...
125    150.0
126    150.0
127    160.0
128    150.0
129    150.0
Name: height_cm, Length: 130, dtype: float64

In [168]:
df.isnull().sum()

patient_id         0
name              23
age               24
gender             0
city               0
admission_date     0
height_cm         26
dtype: int64

In [169]:
df["height_cm"].fillna(df["height_cm"].mean(),inplace=True)

In [170]:
df.isnull().sum()

patient_id         0
name              23
age               24
gender             0
city               0
admission_date     0
height_cm          0
dtype: int64

In [171]:
df["age"].fillna(df["age"].mean())

0      25.0
1      60.0
2      45.0
3      60.0
4      25.0
       ...
125    25.0
126    25.0
127    60.0
128    45.0
129    60.0
Name: age, Length: 130, dtype: float64

In [172]:
df.isnull().sum()

patient_id         0
name              23
age               24
gender             0
city               0
admission_date     0
height_cm          0
dtype: int64

In [173]:
df

    patient_id          name   age gender     city admission_date  height_cm
0         P001           NaN  25.0      F   mumbai     15/01/2024      180.0
1         P002  Rahul Sharma  60.0      F    Delhi     2024/01/16      170.0
2         P003    Neha Singh  45.0      M   Mumbai     2024/01/16      150.0
3         P004    Neha Singh  60.0      M  kolkata     15/01/2024      170.0
4         P005    Neha Singh  25.0      M  kolkata     2024-01-15      180.0
..         ...           ...   ...    ...      ...            ...        ...
125       P006   Anita Verma  25.0      M   Mumbai     2024-01-15      150.0
126       P007    Neha Singh  25.0      F  kolkata     15/01/2024      150.0
127       P008     John Paul  60.0      F  Chennai     2024-01-15      160.0
128       P009           NaN  45.0      M   Mumbai     2024-01-15      150.0
129       P010  Rahul Sharma  60.0      F  Chennai     2024/01/16      150.0

[130 rows x 7 columns]

In [174]:
df["age"]

0      25.0
1      60.0
2      45.0
3      60.0
4      25.0
       ...
125    25.0
126    25.0
127    60.0
128    45.0
129    60.0
Name: age, Length: 130, dtype: float64

In [175]:
df["age"].max()

np.float64(60.0)

In [176]:
df["age"].min()

np.float64(-5.0)

In [177]:
df[df["age"] < 0]

    patient_id          name  age gender     city admission_date   height_cm
11        P012           NaN -5.0      M    Delhi     2024-01-15  180.000000
29        P030    Neha Singh -5.0      M  kolkata     15/01/2024  170.000000
31        P032  Rahul Sharma -5.0      M   Mumbai     15/01/2024  160.000000
34        P035   Anita Verma -5.0      F    Delhi     2024/01/16  160.000000
38        P039    Neha Singh -5.0      M  kolkata     15/01/2024  180.000000
50        P051   Anita Verma -5.0      M    Delhi     15/01/2024  170.000000
58        P059    Neha Singh -5.0      F  kolkata     15/01/2024  160.000000
73        P074           NaN -5.0      M  Chennai     2024/01/16  165.192308
81        P082   Anita Verma -5.0      M  kolkata     15/01/2024  160.000000
89        P090     John Paul -5.0      M  kolkata     2024/01/16  170.000000
94        P095  Rahul Sharma -5.0      M    Delhi     2024/01/16  180.000000
102       P103     John Paul -5.0      F  Chennai     2024-01-15  170.000000
113       P114    Neha Singh -5.0      M   Mumbai     15/01/2024  160.000000

In [183]:
df.loc[df["age"]<0,"age"]= pd.NA

In [188]:
df["age"].fillna(df["age"].mean())

0      25.0
1      60.0
2      45.0
3      60.0
4      25.0
       ...
125    25.0
126    25.0
127    60.0
128    45.0
129    60.0
Name: age, Length: 93, dtype: float64

In [186]:
df["age"].min()

np.float64(25.0)

In [187]:
df["height_cm"].max()

np.float64(180.0)

In [126]:
df["height_cm"].min()

np.float64(150.0)

In [132]:
df.groupby("gender")["height_cm"].mean()

gender
F    164.663462
M    165.772333
Name: height_cm, dtype: float64

In [123]:
df.groupby("city")["gender"].value_counts()

city     gender
Chennai  F         18
         M          7
Delhi    F         14
         M         10
Mumbai   M         17
         F          8
kolkata  M         17
         F         13
mumbai   F         15
         M         11
Name: count, dtype: int64

In [109]:
df

    patient_id          name   age gender     city admission_date  height_cm
0         P001           NaN  25.0      F   mumbai     15/01/2024      180.0
1         P002  Rahul Sharma  60.0      F    Delhi     2024/01/16      170.0
2         P003    Neha Singh  45.0      M   Mumbai     2024/01/16      150.0
3         P004    Neha Singh  60.0      M  kolkata     15/01/2024      170.0
4         P005    Neha Singh  25.0      M  kolkata     2024-01-15      180.0
..         ...           ...   ...    ...      ...            ...        ...
125       P006   Anita Verma  25.0      M   Mumbai     2024-01-15      150.0
126       P007    Neha Singh  25.0      F  kolkata     15/01/2024      150.0
127       P008     John Paul  60.0      F  Chennai     2024-01-15      160.0
128       P009           NaN  45.0      M   Mumbai     2024-01-15      150.0
129       P010  Rahul Sharma  60.0      F  Chennai     2024/01/16      150.0

[130 rows x 7 columns]

In [124]:
df.groupby("city")["height_cm"].mean()

city
Chennai    162.846154
Delhi      167.732372
Mumbai     163.230769
kolkata    165.358974
mumbai     166.797337
Name: height_cm, dtype: float64

In [111]:
df.groupby("city")["height_cm"].max()

city
Chennai    180.0
Delhi      180.0
Mumbai     180.0
kolkata    180.0
mumbai     180.0
Name: height_cm, dtype: float64

In [112]:
df.groupby("city")["height_cm"].min()

city
Chennai    150.0
Delhi      150.0
Mumbai     150.0
kolkata    150.0
mumbai     150.0
Name: height_cm, dtype: float64

In [113]:
df["gender"].value_counts()

gender
F    68
M    62
Name: count, dtype: int64